---
kind: property
id: P:Autodesk.Revit.DB.ViewCropRegionShapeManager.NumberOfSplitRegions
source: html/2d533b30-7190-442d-1c8b-f436e526c40c.htm
---
# Autodesk.Revit.DB.ViewCropRegionShapeManager.NumberOfSplitRegions Property

The number of split crop regions (1 if the crop is not currently split).

## Syntax (C#)
```csharp
public int NumberOfSplitRegions { get; }
```